int/resources/objectRepo/xmlTemplates/opera/Block/req_SetBlockAllocation.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v9="http://micros/opera/ws/rsv/v9_00" xmlns:v91="http://micros/opera/ws/common/v9_00">
   <soapenv:Header/>
   <soapenv:Body>
      <v9:SetBlockAllocationRQ CorrelationID="?" EchoToken="?" Enforce="?" RequestCount="?" TimeStamp="?" Version="?">
         <v91:OperaContext>
            <v91:UserLanguage/>
            <v91:CROCode/>
            <v91:HotelCode/>
            <v91:Language/>
            <v91:RunningApplication/>
            <v91:TerminalId/>
            <v91:LogLevel/>
            <v91:ExternalSystem/>
            <v91:Override/>
            <v91:TargetExternalSystem/>
            <v91:UseLocal/>
            <v91:ExternalData/>
         </v91:OperaContext>
         <v9:Criteria GenericRoomType="?">
            <v91:HotelCode/>
            <v91:BlockID ID="?" IDExtension="?" ID_Context="?" Instance="?" Type="?" URL="?"/>
            <v91:AllocationRoomTypes RoomType="?">
               <v91:AllocationGridDates Allocation="?">
                  <v91:RoomAllocationInfo End="?" Friday="?" Monday="?" Saturday="?" Start="?" Sunday="?" Thursday="?" Tuesday="?" Wednesday="?">
                     <v91:Inventory ForceOverbook="?" FourPerson="?" OnePerson="?" SellLimit="?" ThreePerson="?" TwoPerson="?"/>
                     <v91:Rate ExtraPerson="?" FourPerson="?" OnePerson="?" ThreePerson="?" TwoPerson="?"/>
                  </v91:RoomAllocationInfo>
               </v91:AllocationGridDates>
               <v91:SellLimitGridDates End="?" Friday="?" Monday="?" Saturday="?" SellLimit="?" Start="?" Sunday="?" Thursday="?" Tuesday="?" Wednesday="?"/>
            </v91:AllocationRoomTypes>
         </v9:Criteria>
      </v9:SetBlockAllocationRQ>
   </soapenv:Body>
</soapenv:Envelope>